# IsRectBoundary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Opening..::..IsRectBoundary Property
Opening Class See Also
---
Retrieves the information whether the opening has a rectangular boundary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsRectBoundary { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRectBoundary As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRectBoundary {
	bool get ();
}
```

# Remarks
If the opening has a rectangular boundary, we can get the geometry information from BoundaryRect property. Otherwise we should get the geometry information from BoundaryCurves property.
# See Also
Opening Class
Autodesk.Revit.DB Namespace